Комментарии — это строки кода, которые JavaScript намеренно игнорирует. Комментарии — отличный способ оставить заметки для себя и для других людей, которым позже нужно будет выяснить, что делает этот код.

    Есть два способа писать комментарии в JavaScript:

    Использование //сообщит JavaScript игнорировать оставшуюся часть текста в текущей строке. Это встроенный комментарий:

// This is an in-line comment.
Вы можете сделать многострочный комментарий, начинающийся с /*и заканчивающийся на */. Это многострочный комментарий:

    /* This is a
    multi-line comment */
    ПРИМЕЧАНИЕ. Когда вы пишете код, вы должны регулярно добавлять комментарии, поясняющие назначение частей вашего кода. Хорошие комментарии могут помочь донести цель вашего кода — как для других, так и для вас самих в будущем.

    Попробуйте создать по одному комментарию каждого типа.



Решение

//This is an in-line comment.

/* This is a
multi-line comment */