Поиск остатка в JavaScript
Оператор остатка% дает остаток от деления двух чисел .

    Пример

5 % 2 = 1
5 / 2 = 2 остаток 1
2 * 2 = 4
5 - 4 = 1
Использование
В математике число можно проверить на четность или нечетность, проверив остаток от деления числа на 2. Четные числа имеют остаток 0, а нечетные числа - остаток 1.

17 % 2 = 1
48 % 2 = 0
Примечание. Оператор остатка иногда неправильно называют оператором модуля. Он очень похож на модуль, но не работает должным образом с отрицательными числами.

    Установите remainderравным остатку от 11деления с 3помощью оператора остатка ( %).



Решение

const remainder = 11 % 3;