В JavaScript вы можете сохранить значение в переменной с помощью оператора присваивания ( =).

    myVariable = 5;
Это присваивает Numberзначение .5myVariable

Если справа от =оператора есть какие-либо вычисления, они выполняются до присвоения значения переменной слева от оператора.

    var myVar;
myVar = 5;
Во-первых, этот код создает переменную с именем myVar. Затем код 5присваивается myVar. Теперь, если myVarон снова появится в коде, программа обработает его так, как будто это 5.

Присвоить значение 7переменной a.


    Решение!

// Setup
var a;
a = 7;
// Only change code below this line
